use std::fs::File;
use std::io::{self, BufRead, BufReader, Write};
use std::path::Path;
use std::fs;

mod utils;

fn main() -> io::Result<()> {
    let alphabet = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя";
    let probabilities: Vec<f64> = vec![
        0.08143, 0.01667, 0.04604, 0.01632, 0.03084, 0.08027, 0.00150, 0.00884,
        0.01507, 0.07563, 0.01200, 0.03374, 0.03952, 0.03270, 0.06503, 0.11143,
        0.02931, 0.04774, 0.05482, 0.06829, 0.02647, 0.00310, 0.00827, 0.00455,
        0.01458, 0.00681, 0.00330, 0.01808, 0.01752, 0.00425, 0.00735, 0.01818,
        0.00036,
    ];

    

    Ok(())
}